<template>
  <v-card :loading="loading" class="mx-auto my-12" max-width="374">
    <vue-word-cloud
      style="height: 250px; width: 374px"
      :words="words"
      :color="([, weight]) => translateColor(weight)"
      font-size-ratio="10"
      font-family="Roboto"
    />

    <v-card-title>{{ title }}</v-card-title>
    <v-card-text>2021-06-30</v-card-text>
  </v-card>
</template>
<script>
const colormap = require('colormap')

export default {
  data: () => ({
    loading: false,
    selection: 1,
    words: [
      ['企業', 127],
      ['市民', 117],
      ['接種', 109],
      ['事業', 102],
      ['地域', 100],
      ['情報', 99],
      ['高齢者', 91],
      ['子供', 90],
      ['必要', 88],
      ['支援', 87],
      ['取組', 85],
      ['市長', 81],
      ['教育', 78],
      ['状況', 73],
      ['対応', 72],
      ['実施', 65],
      ['社会', 61],
      ['学校', 61],
      ['道路', 60],
      ['活動', 58],
      ['対策', 56],
      ['自治会', 55],
      ['議員', 53],
      ['課題', 51],
      ['センター', 50],
      ['計画', 48],
      ['デジタル', 47],
      ['調査', 46],
      ['整備', 45],
      ['環境', 44],
      ['推進', 44],
      ['ワクチン', 43],
      ['健康', 42],
      ['地区', 42],
      ['育児', 42],
      ['理解', 41],
      ['生活', 41],
      ['制度', 41],
      ['活用', 40],
      ['子育て', 40],
      ['平成', 39],
      ['父親', 39],
      ['認識', 38],
      ['具体的', 37],
      ['発信', 37],
      ['実現', 37],
      ['平和', 37],
      ['雇用', 37],
      ['施設', 36],
      ['とも', 36],
      ['障がい者', 35],
      ['ごみ', 35],
      ['コロナ', 34],
      ['都市', 32],
      ['予約', 32],
      ['相談', 32],
      ['説明', 31],
      ['利用', 31],
      ['問題', 31],
      ['機能', 31],
      ['個人', 30],
      ['生徒', 30],
      ['草刈り', 30],
      ['男性', 30],
      ['対象', 29],
      ['全て', 28],
      ['行政', 28],
      ['住民', 28],
      ['児童', 28],
      ['促進', 28],
      ['就労', 28],
      ['市内', 27],
      ['程度', 27],
      ['職員', 27],
      ['制服', 27],
      ['民間', 27],
      ['時代', 27],
      ['意見', 26],
      ['参加', 26],
      ['検討', 26],
      ['有料化', 26],
      ['積極的', 25],
      ['目的', 25],
      ['管理', 25],
      ['参画', 25],
      ['男女', 25],
      ['安心', 24],
      ['結果', 24],
      ['先ほど', 24],
      ['浸水', 24],
      ['言葉', 24],
      ['誘致', 24],
      ['振動', 24],
      ['少数者', 24],
      ['安全', 23],
      ['協力', 23],
      ['原発', 23],
      ['現状', 23],
      ['全体', 23],
      ['予算', 23],
    ],
    title: '令和３年６月定例会（第６号）',
  }),
  methods: {
    translateColor(weight) {
      const index = weight
      console.log(index)
      const colors = colormap({
        colormap: 'viridis',
        nshades: 128,
        format: 'rgbaString',
        alpha: 1,
      })
      return colors[index]
    },
  },
}
</script>